biddr_api/app/controllers/auctions_controller.rb

INSERT INTO "auctions" ("title", "description", "end_date", "reserve_price", "created_at", "updated_at", "user_id", "draft", "published", "reserve_met") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
---
    def create
        auction = Auction.new(params.require(:auction).permit!)
        auction.user = @current_user
        if auction.save

SELECT "auctions".* FROM "auctions" WHERE "auctions"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
    def show
        auction = Auction.find params[:id]

SELECT "auctions".* FROM "auctions" ORDER BY "auctions"."created_at" DESC
---
    def index
        auctions = Auction.order created_at: :desc