biddr_api/app/controllers/bids_controller.rb

    def create
        bid = Bid.new(params.require(:bid).permit!)
        auction = Auction.find(params[:auction_id])
        bid.auction = auction
        bid.user = current_user
        if bid.save
---
SELECT "auctions".* FROM "auctions" WHERE "auctions"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
INSERT INTO "bids" ("auction_id", "price", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["auction_id", 3], ["price", 360], ["created_at", "2022-08-23 19:24:26.291515"], ["updated_at", "2022-08-23 19:24:26.291515"], ["user_id", 7]]