biddr_api/app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", nil], ["email", "biddr1@gmail.com"], ["password_digest", "[FILTERED]"], ["created_at", "2022-08-23 18:18:49.082010"], ["updated_at", "2022-08-23 18:18:49.082010"]]
---
    def create
        user_params = params.require(:user).permit!
        user = User.new user_params
        if user.save